{
    "navbar": {
        "brand": "SOCKET E RETI",
        "links": [
            {
                "text": "Home",
                "href": "../Home/index.html",
                "active": false
            },
            {
                "text": "Socket",
                "href": "../Socket/socket.html",
                "active": false
            },
            {
                "text": "Modello OSI",
                "href": "../OSI/iso_osi.html",
                "active": true
            },
            {
                "text": "TCP vs UDP",
                "href": "../TCP_UDP/tcp_udp.html",
                "active": false
            },
            {
                "text": "Glossario",
                "href": "../Glossario/glossario.html",
                "active": false
            }
        ]
    },
    "pageTitle": "Modello ISO-OSI",
    "pageDescription": "In questa sezione scoprirai il modello OSI e i suoi livelli.",
    "osi": {
        "img": "../Immagini/modello_osi.webp",
        "cardText": "Schema del Modello ISO-OSI e dei suoi 7 livelli.",
        "description": "Il modello OSI (Open Systems Interconnection) è un framework concettuale utilizzato per comprendere e standardizzare le funzioni di un sistema di comunicazione in sette livelli distinti. Ogni livello del modello OSI ha un ruolo specifico nella trasmissione dei dati, dalla trasmissione fisica dei segnali fino all'interazione con le applicazioni utente. Questo modello facilita la comunicazione tra diversi sistemi e tecnologie, garantendo che i dati siano trasmessi in modo efficiente e affidabile attraverso le reti. Scopriamo insieme i sette livelli del modello OSI e le loro funzioni principali.",
        "levels": [
            {
                "name": "Physical (Fisico)",
                "description": "Gestisce la trasmissione fisica dei dati attraverso il mezzo di comunicazione, come cavi e segnali."
            },
            {
                "name": "Data Link (Collegamento dati)",
                "description": "Garantisce la trasmissione affidabile dei dati attraverso un singolo link fisico, gestendo errori e sincronizzazione."
            },
            {
                "name": "Network (Rete)",
                "description": "Si occupa dell'instradamento e della consegna dei pacchetti di dati tra dispositivi attraverso reti diverse."
            },
            {
                "name": "Transport (Trasporto)",
                "description": "Assicura la trasmissione affidabile dei dati tra host, con controllo di flusso ed errori. Include protocolli come TCP e UDP."
            },
            {
                "name": "Session (Sessione)",
                "description": "Gestisce l'apertura, la gestione e la chiusura delle sessioni di comunicazione tra applicazioni."
            },
            {
                "name": "Presentation (Presentazione)",
                "description": "Si occupa della traduzione, crittografia e compressione dei dati, rendendoli leggibili per le applicazioni."
            },
            {
                "name": "Application (Applicazione)",
                "description": "Offre un'interfaccia per applicazioni utente, consentendo l'accesso ai servizi di rete tramite protocolli come HTTP e FTP."
            }
        ],
        "modal": {
            "title": "Modello ISO-OSI",
            "img": "../Immagini/modello_osi.webp",
            "description": "Questo schema illustra come TCP gestisce la trasmissione affidabile dei dati tra un client e un server, garantendo l'ordine e l'integrità delle informazioni trasmesse."
        }
    },
    "footer": {
        "text": "Buttini Luca 5-E",
        "smallText": "&copy; 2024 SOCKET E RETI. All rights reserved."
    }
}