{
    "navbar": {
        "brand": "SOCKET E RETI",
        "links": [
            {
                "text": "Home",
                "href": "../Home/index.html",
                "active": false
            },
            {
                "text": "Socket",
                "href": "../Socket/socket.html",
                "active": true
            },
            {
                "text": "Modello OSI",
                "href": "../OSI/iso_osi.html",
                "active": false
            },
            {
                "text": "TCP vs UDP",
                "href": "../TCP_UDP/tcp_udp.html",
                "active": false
            },
            {
                "text": "Glossario",
                "href": "../Glossario/glossario.html",
                "active": false
            }
        ]
    },
    "pageTitle": "Socket",
    "pageDescription": "Le socket, le loro tipologie e come avviene la comunicazione tra server e client.",
    "socketIntro": {
        "title": "Cos'è una socket?",
        "description": "Un socket, in informatica, indica un'astrazione software progettata per utilizzare delle API standard e condivise per la trasmissione e la ricezione di dati attraverso una rete oppure come meccanismo di IPC. È il punto in cui il codice applicativo di un processo accede al canale di comunicazione per mezzo di una porta, ottenendo una comunicazione tra processi che lavorano su due macchine fisicamente separate. Dal punto di vista di un programmatore un socket è un particolare oggetto sul quale leggere e scrivere i dati da trasmettere o ricevere."
    },
    "tcpCard": {
        "img": "../Immagini/sock_tcp.webp",
        "text": "Schema logico della comunicazione TCP mediante socket nel linguaggio C.",
        "modal": {
            "title": "Schema della comunicazione TCP",
            "description": "Schema logico della comunicazione TCP mediante socket nel linguaggio C.",
            "img": "../Immagini/sock_tcp.webp"
        }
    },
    "udpCard": {
        "img": "../Immagini/sock_udp.webp",
        "text": "Schema logico della comunicazione UDP mediante socket nel linguaggio C.",
        "modal": {
            "title": "Schema della comunicazione UDP",
            "description": "Schema logico della comunicazione UDP mediante socket nel linguaggio C.",
            "img": "../Immagini/sock_udp.webp"
        }
    },
    "types": {
        "title": "Tipologie di socket",
        "description": "Le socket si classificano principalmente in due categorie:",
        "categories": [
            {
                "name": "Stream Socket (TCP)",
                "description": "Utilizzate per comunicazioni stabili e affidabili, dove è garantito l'ordine e la consegna dei dati. Si basano sul protocollo TCP."
            },
            {
                "name": "Datagram Socket (UDP)",
                "description": "Ideali per comunicazioni rapide e leggere, senza la necessità di stabilire una connessione fissa. Si basano sul protocollo UDP."
            }
        ]
    },
    "process": {
        "title": "Processo di comunicazione",
        "description": "La comunicazione tramite socket coinvolge due ruoli principali:",
        "roles": [
            {
                "name": "Server",
                "description": "Il dispositivo che si occupa di ricevere le richieste, stabilire connessioni e gestire lo scambio dei dati."
            },
            {
                "name": "Client",
                "description": "Il dispositivo che invia le richieste al server e si connette per ricevere o inviare informazioni."
            }
        ],
        "steps": [
            "Creazione della socket: Entrambi i dispositivi creano una socket come punto di accesso alla rete.",
            "Stabilire la connessione: Il client si collega alla socket del server per iniziare la comunicazione.",
            "Scambio dei dati: I messaggi o le informazioni vengono trasmessi tra client e server.",
            "Chiusura: Terminata la comunicazione, la connessione viene chiusa per liberare risorse."
        ]
    },
    "footer": {
        "text": "Buttini Luca 5-E",
        "smallText": "&copy; 2024 SOCKET E RETI. All rights reserved."
    }
}
